// Сделайте коробку

// Учитывая число в качестве параметра, верните массив, содержащий строки, образующие поле.

// Так:
//     п = 5[
//         '-----',
//         '-   -',
//         '-   -',
//         '-   -',
//         '-----'
//     ]

//     п = 3
//     [
//         '---',
//         '- -',
//         '---'
//       ]

function box(num) {
    let res = [];
    for (let i = 0; i < num; i++) {
        let a = '';
        for (let k = 0; k < num; k++) {
            if (i === 0 || i === num - 1) {
                a += '-';
            } else {
                k === 0 || k === num - 1 ? a += '-' : a += ' ';
            }
        }
        res.push(a);
    }
    // console.log(res);
    return res;
}



box(5); // ["-----", "-   -", "-   -", "-   -", "-----"]